---
title: CurveExtents
classe: Autodesk.Revit.DB.CurveExtents
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# CurveExtents

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double EndParameter { get; }` | `curveExtents.EndParameter` | Double |
| `Boolean IsValidObject { get; }` | `curveExtents.IsValidObject` | Boolean |
| `Double StartParameter { get; }` | `curveExtents.StartParameter` | Double |
| `Void Dispose()` | `curveExtents.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```